Repository: 84000/data-translation-memory
Catalog: toh93-v4.tmx
Source language: bo
Languages: en

source: ལྷའི་གནས་ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གིས་གང་བ། ཡལ་གའི་རྩེ་མོ་ལ་དོ་ཤལ་དང་། སེ་མོ་དོ་དང་མེ་ཏོག་གི་ཕྲེང་བ་སྤྱངས་པ།
en: Those divine abodes are filled with hundreds of thousands of goddesses, the tree branches in them are bedecked with long necklaces, short necklaces, and flower garlands, and their forest clearings are filled with the intoxicating songs of cuckoos.

source: ནགས་ཚལ་གྱི་བར་གྱི་བྱ་ཁུ་བྱུག་རྒྱགས་པའི་སྒྲ་འབྱིན་པ་དེ་དག་ན་ལྷའི་བུ་མོའི་ཚོགས་ཏུ་ཞིང་གོས་དྲི་མ་ཅན་གྱོན་ནས་སའི་སྟེང་ན་འགྲེ་ལྡོག་ཅིང་སྙིང་རྗེ་རྗེ་ལྟར་ལྟ་སྟེ།
en: Within them, a group of goddesses begins to wail as they roll around on the ground, dirtying the clothes they wear, with a pitiful look on their faces. “

source: སའི་སྟེང་ན་འགྲེ་ལྡོག་པས་མེ་ཏོག་གི་བླ་རེས་བརྒྱན་པའི་ས་ཕྱོགས་དག་ན་ཡང་དགའ་བ་མི་རྙེད་དེ།
en: As they roll around on the ground, they no longer find joy in those places ornamented with their flower canopies.

source: དེ་དག་གི་ལུས་ལས་རྔུལ་འབྱུང་ཞིང་དེ་དག་མིག་མི་འཛུམས་པ་ལས་མིག་འཛུམ་པར་འགྱུར་ཏེ།
en: Their bodies start to sweat, and their eyes, which previously never closed, now close.

source: ཉ་ཆུའི་གནས་ནས་བྱུང་ནས་ཉི་མའི་འོད་ཟེར་གྱིས་གདུངས་པ་བཞིན་དུ་ཕན་ཚུན་དུ་འགྲེ་ལྡོག་ཅིང་གཅིག་པུ་ས་ལ་གནས་པར་མཐོང་ནས་ལྷའི་བུ་མོ་དེ་དག་གིས་བསྐོར་ཏེ།
en: They flop around one another like fish out of water baking in the sun’s rays. Seeing him seated alone on the ground, those goddesses surround him. “

source: སྙིང་རྗེ་རྗེ་ལྟར་ལྟ་ཞིང་སྐད་འཐུན་པར་ངུ་སྟེ། འདི་སྐད་ཅེས་ཀྱི་ཧུད་རེ་སྡུག །
en: They have a pitiful look on their faces and wail in unison, saying ‘Alas, how terrible!

source: ཀྱི་ཧུད་རེ་སྡུག །
en: How horrible!

source: ཀྱི་ཧུད་གཞོན་ནུའི་མཆོག་དེ་ཕྱོགས་གང་དུ་སོང་།
en: Alas, where has that most youthful one gone?

source: ལུས་ཆེ་ལ་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། འགྲམ་པ་ཆེ་ལ་མཛེས་པ་བྲང་ཤིན་ཏུ་རྒྱས་པ། སྐྱེད་མོས་ཚལ་སྣ་ཚོགས་ཀྱི་བར་ན་རྒྱུ་བ་དེས་བདག་ཅག་བོར་ཞིང་ལྷ་ཡུལ་བའི་ལྷའི་གནས་ཡིད་དུ་འོང་བ་ཡང་བོར་ཏེ་དགར་འགྲོ་ཞེས་འཛེར་ཏོ།
en: That one with his large body decorated with various ornaments and a prominent and beautiful jawline and broad chest, who used to roam the various garden clearings, has abandoned us and abandoned the pleasing divine abode of the heavenly realm. Where will he go now?’ “

source: །དེ་ནས་ལྷའི་བུ་མོ་དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །རྣམ་པ་སྣ་ཚོགས་ལེགས་པར་བཀོད། །ལྷ་ཡི་ནགས་ཀྱིས་ཤིན་ཏུ་བརྒྱན། །ཟས་དང་དུས་སྟོན་གང་གྱུར་པ། །རྒྱལ་པོ་ཆེན་པོས་གནས་བྱས་པ།
en: Then the goddesses will speak the following verses: “ ‘The Great Kings created this realm Superbly arrayed with various colors, Ornamented with divine forests, And filled with food and festivals. “ ‘

source: །ཀ་བ་བཞི་དང་རབ་ལྡན་པ། །བསོད་ནམས་ཀྱི་ནི་ཚོང་འདུས་མཆོག །ལྷ་ཡི་བུད་མེད་གང་བས་དགའ། །མེ་ཏོག་འབྱོར་པ་ཡིད་འཕྲོག་པ། །བོར་ནས་མི་རྟག་པ་འདི་ཡིས།་།སྡུག་པ་དག་ནི་ཟིན་ཏེ་སོང་།
en: Its supremely auspicious marketplace Bounded by four pillars Is delightful and filled with divine women, And its flowers and riches are enchanting. “ ‘ He is leaving and passing away, And his loved ones are gripped by this impermanence.’ “

source: །དེ་ལྟར་ལྷའི་བུ་བུ་མོ་དེ་དག་གིས་བསྐོར་ཏེ། མཆི་མ་ཟག་སྐད་འགགས་ཤིང་ཐག་རིང་པོ་ཉིད་ནས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ་མེ་ཏོག་གཏོར་ནས་འདི་སྐད་ཅེས་ཀྱེ་མའོ་སྡུག་པ།
en: The goddesses, with tears streaming down and choked voices, surround him, extending their right hands as far as they can and strewing flowers as they say, ‘Alas!

source: ལེགས་པར་བྱེད་པའི་འཇིག་རྟེན་མིའི་འཇིག་རྟེན་དུ་སོང་སྟེ།
en: How sad! He is departing for the world of humans, the world of good deeds.

source: དད་པའི་གཤོལ་གྱིས་བསོད་ནམས་ཀྱི་ཞིང་རྨེད་པར་གྱུར་ཅིག་ཅེས་འཛེར་ཏོ།
en: May he use the plough of faith to plough a field of merit!’ “

source: །དེ་ལྟར་སེམས་པས་ཀུན་དུ་ཁྱབ་པའི་ལུས་ཡོངས་སུ་བཏང་བར་བདག་གིས་རིག་ནས་དེ་རིམས་དྲག་པོ་མི་བཟད་པས་བཏབ་བོ།
en: He then realizes that his body pervaded by thought is abandoning him, and he falls ill with a fierce and unbearable disease.

source: །རིམས་དྲག་པོ་དེས་ལུས་བཤིག་ནས་དེའི་ལུས་མར་གྱི་ཐིགས་པ་རྡོ་ཚན་ལ་ཐིམ་པ་བཞིན་ནོ།
en: After his body has been destroyed by that fierce disease, it is like a drop of butter vaporized in a flash of lightning.

source: །དེའི་ལུས་ཡོངས་སུ་རྙིས་ནས་འདྲུད་པ་ཞེས་བྱ་བའི་རླུང་གིས་རབ་ཏུ་བདས་ཏེ།
en: After that body has withered away it is blown by a wind called dragger.

source: རླུང་དེས་དེའི་ལུས་སྟོང་དུ་གཏོར་ནས་ཕྱེ་མ་ཞིབ་མོ་བཞིན་དུ་ནམ་མཁའི་དཀྱིལ་ནས་ལྷུང་ངོ་།
en: That wind scatters it into thousands of pieces and causes it to fall from the sky as a fine powder. “

source: །དེ་ལྟར་ལྷུང་ནས་མིའི་སྲིད་པར་སྐྱེ་བ་ཡོངས་སུ་ལེན་ཏེ།
en: After it has fallen, he takes a human rebirth.

source: ཕ་མ་འདུས་པ་མཐོང་ནས་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་མའི་མངལ་དུ་སྐྱེའོ།
en: He sees his parents together and arises in the mother’s womb with a happy disposition. “

source: །དེ་ཐོག་མར་སྐྱེས་ཤིང་མའི་མངལ་ན་གནས་པ་ན་མཚན་མ་འབྱུང་བ་ནི་དེའི་མ་དེ་ཁ་ཟས་ལ་རབ་ཏུ་དགའ་བར་འགྱུར། གོས་དམར་པོ་འཚེར་བ་ལ་མངོན་པར་དགའ་བར་འགྱུར། སྐྱེ་བོ་སྣ་ཚོགས་ཕལ་པོ་ཆེ་ལ་ལྟ་འདོད་ཅིང་རྩ་ལག་དང་མཛའ་བ་ཙམ་དུ་འདུ་ཤེས་སྐྱེད་པར་འགྱུར།
en: At first, the following signs arise as that child dwells in the womb: the mother will delight in eating food; she will develop a preference for flashy red clothes; and she will want to see great multitudes of various people and she will think of them as only her relatives and dear ones. “

source: དེ་དེའི་མངལ་དུ་ཞུགས་ནས་མངལ་ན་ཚོར་བ་སྐྱེ་བར་མི་འགྱུར། ཁ་ཆུ་ཟག་པ་དང་། ཆུ་སེར་འབྱུང་བར་མི་འགྱུར། དེའི་ལུས་ན་བར་མི་འགྱུར།
en: After that being has entered her womb, there will be no pain in her womb, she will not salivate or produce lymph, and her body will not experience illness.

source: དེ་དེའི་མངལ་ན་ལག་པ་དང་། རྐང་པ་དང་། མགོ་ཤིན་ཏུ་ཡོངས་སུ་རྫོགས་པར་གྲུབ་ནས། དེ་བཙས་པ་དང་གཟི་བརྗིད་དང་ལྡན་ཞིང་མཐོང་ན་དགའ་བ་རབ་ཏུ་འཕེལ་བར་འགྱུར།
en: The fetus’s hands, feet, and head will develop perfectly in her womb, and when that being is born, he will be radiant, delightful to see, and robust. “

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་གཏམ་ཐོས་ན་དགའ་བ་སྐྱེ་བར་འགྱུར།
en: He will be fond of hearing descriptions about the divine realm of the Four Great Kings.

source: སྦྱིན་པ་ལ་དགའ་བ་དང་། ཆང་ལ་སྲེད་པ་དང་། ཤིན་ཏུ་དྲི་ཞིམ་པའི་ཆ་བྱད་འཛིན་ཅིང་སྐྱེད་མོས་ཚལ་ལ་དགའ་བར་འགྱུར།
en: He will like to give things away, have an attachment to wine, wear perfumed clothing, and be fond of gardens.

source: བུད་མེད་ལ་དབང་པོ་མངོན་པར་རབ་ཏུ་ཆགས་པར་འགྱུར།
en: His sexual organ will lust after women.

source: ཡང་དང་ཡང་ཟས་འདོད་པར་འགྱུར།
en: He will want to eat again and again.

source: གླུ་དང་། གར་དང་། སིལ་སྙན་གྱི་རྗེས་སུ་འཇུག་པར་འགྱུར།
en: He will become immersed in such things as singing, dancing, and playing cymbals.

source: མདོག་སྣུམ་ཞིང་སྔོ་སངས་པོར་འགྱུར། མིག་ལྷའི་བཻ་དཱུརྱ་སྔོན་པོ་ལྟར་འགྱུར་རོ།
en: He will have a supple and dark complexion, and his eyes will be like beryl gems.

source: །དྲང་སྲོང་ཆེན་པོ་འདི་དག་ནི་ལུས་དང་སེམས་ཀྱི་རྒྱུད་ཀྱི་བག་ཆགས་ཀྱིས་བསྒོས་པས་རྒྱལ་ཆེན་བཞིའི་རིས་ནས་ཤི་འཕོ་བའི་ལྟས་སུ་བལྟའོ། །
en: Great Seer, if someone tends toward these physical and mental habits, one should see it as a sign that they have come to this life from the divine realm of the Four Great Kings. “

source: དྲང་སྲོང་ཆེན་པོ་གང་ལ་ལ་སྲོག་གཅོད་པ་སྤངས་ནས་དད་ཅིང་དང་བས་སྦྱིན་པ་སྦྱིན་ཞིང་། མ་བྱིན་པར་མི་ལེན་པ་དང་། བཟའ་བ་དང་། བཅའ་བ་དང་། བལྡག་པ་དང་། གཞིབ་པ་དང་། ཡོ་བྱད་ཀྱི་ཁྱད་པར་སྤངས་ནས་ནོར་བུ་དང་། གསེར་དང་། དངུལ་དང་། རྡོ་རྗེ་དང་། བཻ་དཱུརྱ་ལ་སོགས་པ་རྫས་ཐམས་ཅད་རབ་ཏུ་སྦྱིན་པ་ལ་བསྟན་པ་དང་། བསྒོམས་པ་དང་། མང་དུ་བྱས་ནས་དད་པ་དང་། རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་མེ་ཏོག་གི་ལྡ་ལྡི་འབུལ་བ་དང་། མཆོད་རྟེན་ལ་མངོན་པར་ཕྱག་འཚལ་བ་ལ་སོགས་པའི་རྣམ་པར་སྨིན་པས་ཚེ་ཡོངས་སུ་ཟད་པའི་དུས་ན་ལུས་ལ་ཉོན་མོངས་པ་ཆུང་བར་འགྱུར།
en: Great Seer, if a person gives up killing; has faith and because of that faith gives a gift; does not take what is not given; gives up specific types of provisions that are eaten, drunk, licked, and sucked; takes recourse to giving away all manner of material things such as gems, gold, silver, diamonds, and beryl; cultivates and performs those actions many times over; offers flower garlands faithfully and joyously; or prostrates before a stūpa, the karmic fruition of such deeds will result in their body possessing very few defilements at the time of death.

source: སྣུམ་པའི་དྲི་མ་དང་། དྲི་ང་བ་རྣམ་པར་སྤངས་ནས་རང་གི་དགེ་བའི་རྩ་བ་རྗེས་སུ་དྲན་ཞིང་འཆི་བའི་དུས་ཀྱི་ཚེ་རབ་ཏུ་དང་བའི་ལྟས་མཐོང་བར་འགྱུར་རོ། །འདི་ནི་དེའི་ལྟས་ཡིན་ཏེ།
en: The fact that they are free of any putrid excretions or foul smells will prompt them to reflect on their roots of virtue, and they will be serene at the time of death. “

source: བཞིན་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་འགྱུར། དེའི་སྣ་ཡོན་པོར་མི་འགྱུར། དེའི་སྙིང་འཕར་བར་མི་འགྱུར། མིད་པ་ནས་སྒྲ་ངར་ངར་པོ་འབྱུང་བར་མི་འགྱུར། དེའི་ལུས་ལ་དབུགས་རྒོད་པར་མི་འགྱུར།
en: The person’s complexion will take on a golden color, his nose will not become crooked, his heart will not flutter, he will not have to clear his throat, and his body will not produce a wheezing sound.

source: དེའི་ལུས་གདུང་བར་མི་འགྱུར། དབང་པོ་འགྱུར་བ་མ་ཡིན། ཡན་ལག་དང་ཉིང་ལག་ཀུན་དུ་ཆད་པར་མི་འགྱུར། གཤིས་ཀྱི་མཚམས་འཇིགས་པར་མི་འགྱུར།
en: His body will not become overheated, his sense faculties will not change, his limbs and organs will not fail, and his joints will not fail.

source: མལ་གྱི་སྟེང་ན་འགྲེ་ཞིང་ལྡོག་པ་བྱེད་པར་མི་འགྱུར། དམན་པའི་ཚིག་ལྟ་བུ་སྨྲ་བར་མི་འགྱུར།
en: He will not toss and turn in bed, and he will not utter vulgarities.

source: རིམས་ནད་ཀྱིས་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར། ཕ་རོལ་པོས་དུག་བྱིན་པས་གནོད་པར་མི་འགྱུར།
en: He will not die from a fever, and he will not be harmed when an enemy poisons him.

source: མེ་ཏོག་དང་འབྲས་བུ་ལ་བརྐམ་པའི་ཕྱིར་ཤིང་ལ་འཛེགས་ནས་ལྷུང་བས་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར།
en: If he climbs a tree because he wants its flowers or fruits and then falls, he will not die.

source: ཡིད་དུ་མི་འོང་བའི་ཁ་ཟས་ཟོས་ཏེ། ཁ་ཟས་མ་ཞུ་བས་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: If he eats unpleasant foods and suffers indigestion, it will not kill him. “

source: །གལ་ཏེ་མིའི་ཕུང་པོ་ཡོངས་སུ་བཏང་ནས་ཀྱང་ལྷའི་ནང་གི་རྣམ་པར་ཤེས་པས་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷ་རྣམས་མཐོང་སྟེ།
en: After it casts off that human body, his consciousness will be among the gods and see the gods of the Heaven of the Thirty-Three.

source: ཁང་པ་བརྩེགས་པ་ནོར་བུ་དང་། གསེར་དང་། བཻ་དཱུརྱ་དང་། དངུལ་སྟོང་གིས་རྣམ་པར་བརྒྱན་ཅིང་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བས་སྤྲས་པ།
en: It will see a divine palace ornamented a thousand times over with jewels, gold, beryl, and silver and with a perfectly symmetrical layout.

source: གསེར་གྱི་ཉ་དང་། ཆུ་སྲིན་གྱི་རྒྱལ་མཚན་དང་། རྟ་བབས་དང་། བ་དན་གྱིས་མཛེས་པར་བྱས་པ།
en: It will be decorated with victory banners emblazoned with golden fish and makara sea monsters, arched gateways, and flags.

source: རོལ་མོའི་དབྱངས་སྒྲ་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱི་སྒྲ་སྙན་པ་འབྱུང་བ་དང་། གནས་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ།
en: Sweet musical melodies and the sounds of various cymbals will resound, and it will be surrounded by various dwellings.

source: ཤིང་འདབ་ཆགས་པས་བརྒྱན་པའི་ནགས་ཚལ་གྱི་ནང་ན་འདུག་པ།
en: The palace will sit within a wood with trees that are ornamented by birds.

source: ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་ཆུས་ཆག་ཆག་བཏབ་པས་འདམ་དུ་གྱུར་པ། ལྷའི་ནོར་བུའི་སྒྲོན་མའི་ཕྲེང་བས་བརྒྱན་ཅིང་མཛེས་པར་བྱས་པ།
en: It will be sprinkled with water scented with uragasāra sandalwood, and it will be ornamented and decorated with strings of divine jewel lamps.

source: བུད་མེད་འབར་བ་སྣ་ཚོགས་རྣམ་པར་རྩེ་བས་མཛེས་པར་བྱས་པ།
en: The palace will be beautified by the play of various radiant women. “

source: དཔུང་རྒྱན་དང་། གདུ་བུ་དང་། སོར་གདུབ་དང་། སེ་མོ་དོ་དང་། དོ་ཤལ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་ཅིང་མཛེས་པར་བྱས་པའི་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷ་རྣམས་མཐོང་ངོ་།
en: The consciousness will see the gods of the Heaven of the Thirty-Three ornamented and decorated with various things such as armlets, bracelets, rings, short necklaces, and long necklaces. “

source: །དྲང་སྲོང་ཆེན་པོ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་དེ་ན་ལྷའི་བུ་དེ་དག་མཆོག་གི་སྐྱེད་མོས་ཚལ་དུ་སོང་སྟེ་རྩེ་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཅིང་འདོད་པས་རྒྱགས་མྱོས་ནས་དེ་དག་སྐྱེད་མོས་ཚལ་དང་། ནགས་ཚལ་གྱི་བར་དུ་འགྲོ་ཞིང་དགའ་བ་སྐྱེད་དོ།
en: Great Seer, the gods of the Heaven of the Thirty-Three go to the best gardens, where they play and indulge their sensual desires, become intoxicated with desire, and then go to wooded glades and give rise to bliss. “

source: །སེམས་ཅན་དེའི་རྣམ་པར་ཤེས་པ་དེ་བསོད་ནམས་སུ་ཉེ་བར་འགྲོ་བ་ཡིན་པས་སེམས་ཅན་དེས་ལྷ་དང་ལྷ་མོ་ཁྲི་གཅིག་གི་སྟེང་ན་འདུག་པ་མཐོང་ནས་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་མྱུར་བ་མྱུར་བར་ནོར་བུ་སྐུད་པ་ལ་བརྒྱུས་པ་འཆུགས་པ་བཞིན་དུ་སོང་སྟེ་སྐྱེའོ།
en: Since the consciousness of that being is disposed toward merit, it sees those gods and goddesses seated on thrones, experiences intense joy, and sets out and is reborn there like a jewel quickly strung onto a necklace.

source: །སེམས་ཅན་དེ་འཇུག་པའི་ཚེ་ལྷ་མོ་དེའི་ལག་མཐིལ་གཉིས་ནས་མེ་ཏོག་འབྱུང་ངོ་།
en: As that being enters that new realm, a flower appears from a goddess’s palms.

source: །སེམས་ཅན་དེས་མེ་ཏོག་དེ་མཐོང་ནས་འཇུག་སྟེ་ལྷ་མོ་དེ་ལྷ་ལ་དགའ་བ་དང་བདེ་བའི་ཡིད་ཀྱིས་ལྟ་ཞིང་ལག་པ་གཉིས་ཀྱིས་མེ་ཏོག་དེ་མཉེས་ནས་དེའི་ལག་པ་ཕྲད་པའི་རྐྱེན་གྱིས་ལྷའི་ནང་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: That being sees the flower and enters it. The goddess gazes at the god with love and joy, caresses the flower with her two hands, and joins her two hands. That provides the condition for him to take rebirth among the gods. “

source: །དེ་སྐྱེས་པའི་ཚེ་ལྷ་མོ་དེ་ལྷ་ལ་ལྟ་ཞིང་གཞོན་ནུ་སྐྱེས་ཀྱིས་ཁྱོད་དགའ་བ་སྐྱེད་ཅིག་ཅེས་ཟེར་ཏེ་ཕ་མ་དེ་གཉིས་ཡིད་དགའོ།
en: When he is born, she will look at the god and say, ‘You will be pleased to know that it is a young boy!’ and both parents will rejoice.

source: །གཞོན་ནུ་དེ་ཞག་བདུན་འདས་ནས་རྣ་ཆ་སྣ་ཚོགས་འགུལ་བ་འཕྱང་བ་མངོན་པར་འགྲུབ་བོ། །དེ་ཞག་བདུན་འདས་ནས་འདི་ལྟ་བུ་དྲན་པར་འགྱུར་ཏེ། བདག་ཆེ་གེ་མོ་ཞིག་ནས་འདིར་འོངས་ཏེ་འདི་གཉིས་ནི་བདག་གི་ཕ་མ་ཡིན་ནོ།
en: After seven days, he will have manifested various earrings that dangle and shimmer, and after seven days he will remember, ‘I have come here from such and such a previous birth, and now these two are my parents.’

source: །བདག་གིས་དགེ་བའི་ལས་ནི་འདི་བྱས་སོ་སྙམ་དུ་དེ་ལྟར་སེམས་ཤིང་ཉེ་བར་རྟོག་པ་ན་དགའ་བ་ཆེན་པོ་སྐྱེའོ།
en: He will think, ‘I accomplished this virtuous deed,’ and when he realizes that he will be extremely delighted. “

source: །དེ་དགའ་བས་མྱོས་ནས་རྒྱགས་པས་འདོད་པ་ལ་སྲེད་པར་འགྱུར།
en: Intoxicated with joy, his vanity will lead to attachment to desire.

source: རྒྱང་རིང་པོ་ཉིད་ནས་ལྷའི་གནས་ཡངས་པ་ཉེ་བར་གནས་པ་དེ་དེས་མཐོང་ནས་དེ་ལ་མངོན་པར་དགའ་བའི་སེམས་སྐྱེ་བར་འགྱུར་རོ། །
en: He will gaze from afar at the vast expanse of the god realm in which he currently resides, and his mind will delight in it.

source: དེ་ལྷའི་འགྲོས་ཀྱི་ཚུལ་གྱིས་གླང་པོ་རྒྱགས་པའི་འགྲོས་ལྟར་འགྲོ་བ། བྲང་ཆེ་བ། ལག་པ་རིང་ཞིང་རབ་ཏུ་འཕྱང་བ། རོ་སྟོད་སེང་གེ་འདྲ་བ། ལྟེ་བ་ཟབ་པ། རྐེད་པ་གཞུའི་ཆང་ཟུངས་ལྟར་ཕྲ་བ། སྒལ་ཚིགས་རིམ་བཞིན་འདུག་པ། བརླ་ཆུ་ཤིང་གི་སྡོང་པོ་ལྟར་མཁྲེགས་པ།
en: He will move with a divine gait resembling the gait of an elephant in rut; he will have a large chest and arms that are long and pendulous; his upper torso will be like that of a lion; his navel will be deeply indented; his waist will be narrow like the handle of a bow; his vertebrae will be in their proper order; and his thighs will be firm like the trunk of a plantain tree. “

source: ལྷའི་སྨྲ་བ། ཨག་ཙོམ་དང་སྤུ་ཐུང་བ། དྲི་ང་བ་མེད་པ། ལྷའི་དྲི་ཡོངས་སུ་བཟུང་བ། ལུས་ལྷབ་ལྷུབ་ཀྱིས་སྤུད་པ། ལྷའི་གོས་འབར་བ་བགོས་པ།
en: He will have the voice of a god, his beard and body hair will be short, he will be free of bad odors, and he will have a divine fragrance.

source: ཡིད་གཅིག་ཏུ་བརྟགས་ཀྱང་ལུས་མཛེས་པ་སྟེ། དེ་ལྷའི་གནས་དེ་ན་ལྷའི་བུ་མོ་ཁ་ཅིག་གིས་ནི་ཀུན་ནས་བསྐོར་ཅིང་གནས། ཁ་ཅིག་ནི་རྩེ་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཅིང་འདི་སྐད་ཅེས་འཛེར་ཏེ།
en: His body will be adorned with jewelry, and he will wear radiant divine robes. His mind will be focused, and his body will be beautiful. “ He will live in that divine abode surrounded by several goddesses, some of whom indulge in flirting with him, saying,

source: ཇོ་ཅོ་ལྷའི་གནས་འདིར་སྙུན་མི་མངའ་ཞིང་ལེགས་པར་བྱོན་ཏམ།
en: ‘Lord, are you well? Did your journey to this divine realm go well?

source: ཁྱོད་བདག་ཅག་གི་མགོན་དུ་གྱུར་ཅིག །བདག་ཅག་ལང་ཚོ་ལ་བབ་པ། གཟུགས་ཕུན་སུམ་ཚོགས་པ། ནུ་མ་གསེར་གྱི་བུམ་པ་ལྟར་འབུར་བ། མཆུ་པད་མ་འདྲ་བ། གཟུགས་སྤྲིན་གྱི་ནང་ནས་གློག་འབྱུང་བ་འདྲ་བ་དག་དང་། གཞལ་མེད་ཁང་ཆེན་པོ་དང་། ཤིང་ཡོངས་འདུ་ས་བརྟོལ་མྱུ་གུ་དང་ཡལ་ག་ཆགས་པས་མཛེས་པར་བྱས་པ།
en: You should be our husband! We are in the prime of life, our bodies are fully developed, our breasts protrude like golden vases, our lips are like lotus blossoms, and our bodies are pure, just like a flash of lightning from a raincloud. This place is beautified by a great palace and the growing shoots and boughs of the wish-fulfilling kovidāra tree.

source: བུད་མེད་དྲུག་ཁྲི་ལང་ལོང་དུ་གྱུར་པ་འདི་དག་ལ་ཇོ་ཅོ་དགྱེས་པར་མཛོད་ཅིག་ཅེས་འཛེར་ཏོ།
en: My lord, you should enjoy this excited crowd of sixty thousand women!’ “

source: །ལྷའི་གནས་པི་བང་དང་། གླིང་བུ་དང་། རྫ་རྔ་དང་། ཅང་ཏེའུ་དང་། གླུ་དབྱངས་འབྱུང་བ་དེ་དག་ན་ལྷའི་གདིང་བས་མཛེས་པར་བྱས་པའི་སེང་གེའི་ཁྲི་མཐོང་ངོ་།
en: The sound of lutes, flutes, drums, hand drums, and singing will fill that divine realm.

source: །དེས་དེ་མཐོང་ནས་རྒྱལ་བུ་དར་མང་པོས་བཅིངས་ཏེ་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་བཞིན་དུ་དེ་སེང་གེའི་ཁྲི་ལ་འཛེགས་ནས་འདུག་གོ །དེ་དེ་ན་གནས་པ་ན་རྟག་ཏུ་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱུང་ངོ་། །
en: He will see a lion throne decorated with divine cushions, and as he sees it, he will be like a prince wrapped with many silk scarves receiving the crown consecration, and he will ascend and sit on the throne. “

source: ལྷའི་རོལ་མོའི་སྒྲ་འབྱུང་ངོ་། །ཕྱོགས་ཀུན་ནས་ཀྱང་འདི་ལྟ་བུའི་སྒྲ་གྲག་སྟེ། འདི་ནི་བསོད་ནམས་སུ་ཉེ་བར་འགྲོ་བའི་སེམས་ཅན་ཏེ།
en: Pleasant sounds and divine music will resound at all times while he is seated there, and the following proclamation will ring out in all directions: ‘This being is predisposed to merit.

source: འཛམ་བུའི་གླིང་ནས་ཤི་འཕོས་ནས་བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བཟུང་བས་ལྷའི་གནས་འདིར་སྐྱེས་ཀྱིས་བདག་ཅག་དེའི་གན་དུ་འདོང་ངོ་།
en: He died in the continent of Jambudvīpa and was born here in this divine realm because of the merit that he possessed.

source: །ཉེ་བར་གནས་ནས་དགའ་མགུར་སྤྱད་པར་བྱའོ། །རོལ་མོའི་དབྱངས་སྒྲ་དང་གར་གྱིས་རྩེ་བར་བྱའོ་ཞེས་སྒྲོགས་སོ།
en: Let us go to him and amuse him as we play music and dance!’ “

source: །དེ་བུད་མེད་དྲུག་ཁྲི་དང་དགའ་མགུར་སྤྱོད་དེ། དེ་དག་ཐམས་ཅད་ཀྱང་ལག་ན་མེ་ཏོག་ཐོགས་པ།
en: Those sixty thousand women will all hold flowers in their hands as he amuses himself with them.

source: ཤིན་ཏུ་དྲི་ཞིམ་པས་དྲི་ཞིམ་པའི་ཆ་བྱད་ཅན། དུ་ཀུ་ལའི་རས་ཀྱི་བླ་གོས་བགོས་པ། རྒྱན་དམ་པ་དང་། རྐང་གདུབ་སྒྲ་སྙན་པ།
en: They will be clad in garments scented with extremely fragrant perfumes and wear upper robes of fine dukūlam cotton, superior ornaments, and tinkling foot bangles.

source: བཞིན་པད་མ་ལྟ་བུ་ལ་ཟླ་གམ་ལྟ་བུས་མཛེས་པར་བྱས་པ་དག་སྦྲང་རྩི་དང་།
en: Their faces will be like lotuses beautifully illuminated by a crescent moon.

source: སྦྲང་ཆང་མངར་བ་དང་། མེ་ཏོག་གི་ཆང་གིས་རྒྱགས་ཤིང་མྱོས་པས་འཁྱུད་ནས་འདུག་སྟེ། དེ་དག་ཐམས་ཅད་འདི་སྐད་ཅེས་བདག་ཅག་ཐམས་ཅད་ཇོ་ཅོ་འདིའི་གཡོག་དང་བསྙེན་བཀུར་བྱའོ།
en: They will be drunk on honey, sweet mead, and flower wine and sit there in the grips of intoxication as they say, ‘Let us all serve and honor this lord! You possess the beautiful fragrance of the higher realms that you realized thanks to your merit.

source: །ཁྱོད་འདི་ནས་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་བསྒྲུབས་པའི་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་གྱི་དྲི་ཞིམ་ཞིང་བདེ་བའི་ལྷའི་འདོད་པའི་ལོངས་སྤྱོད་ཤིས་པ་འདི་ལ་ཀུན་དུ་སྤྱོད་ཅིག་ཅེས་འཛེར་ཏོ། །
en: Now you should indulge yourself in the glorious enjoyment of blissful divine sensual pleasures.’ “

source: དྲང་སྲོང་ཆེན་པོ་ལྷའི་བུ་དེ་དང་། ལྷའི་བུ་མོ་དེ་དག་ལྷན་ཅིག་ཏུ་དགའ་ཚལ་དང་། །འདྲིས་ཚལ་དང་། ཨར་མོ་ནིག་ལྟ་བུའི་རྡོ་ལེབ་དང་། རྣམ་པར་མཉམ་འཕྲུལ་དང་། རབ་འབབ་དང་། སེང་སེང་པོ་དང་། མེ་ཏོག་གི་འཕྲལ་ཐབས་དང་། ཤིང་ཡོངས་འདུ་ས་བརྟོལ་ལ་སོགས་པའི་སྐྱེད་མོས་ཚལ་དམ་པ་མཆོག་ཏུ་བདེ་ཞིང་བསིལ་བ།
en: Great Seer, that god and those goddesses are supremely happy and enjoy the cool of the best parks in which there are gardens, pleasure groves, stone platforms like Indra’s throne, magical emanations, superb rains, lattices, flowers that open immediately, and wish-fulfilling kovidāra trees.

source: གནོད་པའི་རླུང་མེད་པ། ལྷའི་བྱ་ནམ་མཁའ་འགྲོ་ཞེས་བྱ་བའི་སྒྲ་སྙན་པས་མཛེས་པར་བྱས་པ། ལྷའི་མེ་ཏོག་དང་། འབྲས་བུ་དང་། སྤོས་ཀྱིས་ཀུན་དུ་གང་བ།
en: There are no harmful winds, it is beautified by the sweet calls of the divine sky-going birds, and it is filled with divine flowers, fruits, and perfumes.

source: བཻ་དཱུརྱ་དང་། ནོར་བུ་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲོན་མ་ཅན།
en: It has lamps made of various kinds of precious substances such as beryl, jewel, coral, and emerald.

source: བུང་བ་དང་། ཁུ་བྱུག་རྒྱགས་པ་དང་། བྱ་སྒྲ་སྙན་པ་འབྱིན་པ།
en: It resounds with bees, mating cuckoos, and sweet bird songs.

source: རྨ་བྱ་འདབ་གཤོག་རྩེ་མོ་གསེར་ཅན་ཡོད་པ། ནོར་བུ་དང་། རིན་པོ་ཆེའི་ཐིག་ལེས་རྣམ་པར་བཀྲ་ཞིང་བཀྲ་ཤིས་པ་ཡོད་པ། སྣ་མཐོ་ཞིང་རིང་བ། བཻ་དཱུརྱའི་མཆུ་ལས་སྒྲ་སྐད་སྙན་པ་སྣ་ཚོགས་འཐུན་པར་སྒྲོགས་པ།
en: The peacocks have gold-tipped wings that bear auspicious marks and are decorated with jewel and gemstone dots, and they have high, long noses and beaks of beryl, from which emerge various lovely and harmonious bird songs.

source: མེ་ཏོག་བཀྲམ་པ་རྣམ་པར་ཕྱེ་བས་བརྒྱན་པའི་ཕྱོགས་རྣམས་ན་ལྷའི་བུ་འདི་དག་འདོད་པས་ངོམས་པས་རྒྱུན་དུ་ལོངས་སྤྱོད་པར་གྱུར་ཏེ་གནས་སོ།
en: These gods dwell in such perfectly arranged places scattered with flowers, satisfying their desires and continually indulging in pleasure. “

source: །སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་གནས་དེ་ན་རྫིང་བུ་གྲུ་བཞི་པ་ཟབ་པ། ཆུ་དང་བ། ཧ་ཅང་གྲང་བ་ཡང་མ་ཡིན། ཧ་ཅང་དྲོ་བ་ཡང་མ་ཡིན་པ།
en: In the divine Heaven of the Thirty-Three there are deep, square-shaped pools with clear water that is neither too hot nor too cold.

source: ཡིད་དུ་འོང་བ། ཆུ་དྲི་མ་མེད་པ། པད་མ་འདབ་མ་བརྒྱ་པ་ཁ་བྱེ་བ་ཡོད་པ། ངོགས་ཤིང་གིས་མཛེས་པར་བྱས་པ།
en: They are pleasant, the water is pure, there are hundred-petaled lotuses blooming in them, and they are decorated with trees growing along their banks.

source: མེ་ཏོག་བཀྲམ་པས་ཆུ་ཡིད་དུ་འོང་བའི་རྫིང་བུ་དེ་དག་ན་ལྷའི་བུ་དེ་དག་ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གིས་བསྐོར་ནས་ཆུ་ལ་རྩེ་བ་རྗེས་སུ་མྱོང་ཞིང་བདེ་བར་གནས་སོ། །
en: The gods enjoy playing in the pleasant water of those pools, with flowers sprinkled about, surrounded by hundreds of thousands of goddesses, and they live happily there. “

source: དྲང་སྲོང་ཆེན་པོ་དེ་དག་ན་དེ་དག་གི་སྐྱེད་མོས་ཚལ་དང་། ནགས་ཚལ་གྱི་གམ་ཡོ་ན་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཐིག་ལེས་རྣམ་པར་བཀྲ་བའི་སྣོད་མངོན་པར་འགྲུབ་སྟེ། ལྷའི་བུ་དེ་དག་སྣོད་དེ་དག་འདོད་པ་ན་མེ་ཏོག་ཀུན་ད་དང་། ཀུ་མུ་ད་དང་། ཁ་བ་ལྟ་བུ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུའི་ཁ་ཟས་མངོན་པར་འགྲུབ་བོ། །
en: Great Seer, containers decorated with various colored marks manifest among the gods there, in the vicinity of their gardens and groves, and when the gods wish, the containers produce food with colors like jasmine flowers, red lotus, white snow, and silver.

source: དྲང་སྲོང་ཆེན་པོ་རིན་པོ་ཆེའི་སྣོད་གཅིག་ལ་ཟ་བ་ན། གང་གིས་ཁ་ཅིག་གི་ཁམ་བླངས་པ་ནི་རིན་པོ་ཆེའི་ཁ་དོག་ལྟ་བུར་གྱུར། ཁ་ཅིག་གི་ཁམ་བླངས་པ་ནི་ཁ་དོག་སེར་པོ་དང་། སྔོན་པོ་དང་། དཀར་པོར་གྱུར་ཏེ།
en: When some of the gods eat from one of the jewel containers, Great Seer, the food is like the color of a jewel, while when some take a morsel of food it is yellow, blue, or white.

source: ཁ་དོག་གཅིག་ཏུ་འདྲ་བར་ཁ་དོག་རྒྱས་པ་མཆོག་དང་ལྡན་པ་གཅིག་པ་དེ་དག་གི་རིན་པོ་ཆེའི་སྣོད་དེ་དག་ལས་ཁ་ཟས་ཀྱི་ཁྱད་པར་སོ་སོ་ཐ་དད་པར་འབྱུང་སྟེ། དེ་ནི་དེ་དག་གི་སྦྱིན་པ་ཉེ་བའི་ཉོན་མོངས་པ་ཅན་གྱི་རྣམ་པར་སྨིན་པར་བལྟ་སྟེ།
en: There is one such color that has the best and most magnificent hue. Those are the particular types of food that come from their jeweled containers, which are seen to be the karmic fruition of giving tainted by minor afflictions. “

source: གང་གིས་སྔར་སྦྱིན་པ་བྱིན་ལ་ཕྱིས་འགྱོད་པར་གྱུར་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་དེའི་ཟས་ཁ་དོག་ངན་པར་འགྲུབ་བོ།
en: In cases where the karmic result is related to giving a gift but later regretting having done so, the food takes on an inferior color.

source: །གང་གིས་སྔར་སྦྱིན་པ་བྱིན་ལ་ཕྱིས་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཀྱིས་སྙིང་རྗེ་བསྐྱེད་དེ་དགའ་བ་བསྐྱེད་པར་གྱུར་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་དེའི་ཟས་ཀྱི་བྱེ་བྲག་ཁ་དོག་བཟང་པོ་རིན་པོ་ཆེ་ལྟ་བུར་སྣང་བ་འགྲུབ་སྟེ།
en: In cases where the karmic result is related to giving a gift and then later generating compassion with a loving intention and engendering joy, the specific type of food that results shines like a precious jewel.
